In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [2]:
path=r'/Users/sofiakazeko/Jupiter/Dec-2024 Instacart Basket Analysis'

In [3]:
# importing customers.csv
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = None)

In [4]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_cust.shape

(206209, 10)

# 4.Wrangle the data

In [10]:
df_cust.rename(columns = {'Surnam' : 'Surname', 'n_dependants': 'number_of_dependants','fam_status' :'Family_status'}, inplace = True)

In [11]:
df_cust.head()

,user_id,First Name,Surname,Gender,STATE,Age,date_joined,number_of_dependants,Family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

I've renamed some of the columns to make them, more descriptive. All the columns look informative to me, so I will not delet any of them as of now.

# 5.Fundamental data quality and consistency checks

In [13]:
print(df_cust.dtypes)

user_id                  int64
First Name              object
Surname                 object
Gender                  object
STATE                   object
Age                      int64
date_joined             object
number_of_dependants     int64
Family_status           object
income                   int64
dtype: object

In [17]:
# checking and changing data types
df_cust['user_id'] = df_cust['user_id'].astype(str)

In [16]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

First Name

In [20]:
df_cust['First Name'] = df_cust['First Name'].astype(str)

In [21]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [22]:
df_cust['date_joined'] = df_cust['date_joined'].astype('datetime64[ns]')

In [23]:
print(df_cust.dtypes)

user_id                         object
First Name                      object
Surname                         object
Gender                          object
STATE                           object
Age                              int64
date_joined             datetime64[ns]
number_of_dependants             int64
Family_status                   object
income                           int64
dtype: object

In [25]:
# Finding Missing Values
df_cust.isnull().sum()

user_id                 0
First Name              0
Surname                 0
Gender                  0
STATE                   0
Age                     0
date_joined             0
number_of_dependants    0
Family_status           0
income                  0
dtype: int64

In [27]:
# Finding Duplicates
df_dups = df_cust[df_cust.duplicated()]

In [28]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, STATE, Age, date_joined, number_of_dependants, Family_status, income]
Index: []

no duplicates or missing values were found.

In [29]:
df_cust.describe()

,Age,date_joined,number_of_dependants,income
count,206209.000000,206209,206209.000000,206209.000000
mean,49.501646,2018-08-17 03:06:30.029532928,1.499823,94632.852548
min,18.000000,2017-01-01 00:00:00,0.000000,25903.000000
25%,33.000000,2017-10-23 00:00:00,0.000000,59874.000000
50%,49.000000,2018-08-16 00:00:00,1.000000,93547.000000
75%,66.000000,2019-06-10 00:00:00,3.000000,124244.000000
max,81.000000,2020-04-01 00:00:00,3.000000,593901.000000
std,18.480962,NaN,1.118433,42473.786988

In [31]:
df_cust['Gender']. value_counts(dropna=False)

Gender
Male      104067
Female    102142
Name: count, dtype: int64

according to mins and max values for age, # of dependants and income look normal. Gender values are standartized.

In [32]:
# import the df_ords_prods_merge with fixed outliners
ords_prods_merge= pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'df_ords_prods_merge_final.pkl'))

In [33]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_time,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,prices,price_range_loc,busiest_day,busiest_period_of_day,max_order,loyalty_flag,mean_prices,spending_flag,median_days,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,9.0,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,12.5,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,4.4,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,4.7,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,1.0,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [34]:
ords_prods_merge.shape

(32404859, 23)

In [36]:
# updating user_id to str
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype(str)

In [37]:
# merging the dfs using inner merge
df_cust_merge= ords_prods_merge.merge(df_cust,on= 'user_id', indicator = True)

In [38]:
df_cust_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_time,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,First Name,Surname,Gender,STATE,Age,date_joined,number_of_dependants,Family_status,income,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423,both

In [39]:
df_cust_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [40]:
# Export data to pkl
df_cust_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_cust_merge.pkl'))